# Семинар №9: pthread и execve

```c
#include <pthread.h>

int 
pthread_create(pthread_t *thread, const pthread_attr_t *attr, void *(*start_routine) (void *), void *arg)l
```

! Компилировать и линковать с параметром `-lpthread` !

Напишем функцию, которая будет запускаться в отдельном потоке. Она должна возвращать `void *`!

Отметим, сразу же после создания нити она начнет выполняться. Кроме того, основная программа должна дождаться завершения нитей. Сделать это можно через pthread_join.

```c
#include <pthread.h>
#include <stdio.h>
#include <string.h>
#include <errno.h>

enum
{
    ERR_IN_THREAD_CREATE = 1,
    ERR_IN_JOIN = 2
};

void *
printInThread(void *msg)
{
    printf("Мистер Сальери передает вам привет: %d - %s\n", syscall(SYS_gettid), (char *)msg);
}

int 
main()
{
    pthread_t thread1, thread2;
    if (pthread_create(&thread1, NULL, printInThread, "Thr1") != 0 || pthread_create(&thread2, NULL, printInThread, "Thr2") != 0) 
    {
        fprintf(stderr, "%s: Error in pthread creation - %s\n", __FILE__, stderror(errno));
        return ERR_IN_THREAD_CREATE;
    }

    if (pthread_join(thread1, NULL) != 0 || pthread_join(thread2, NULL) != 0) {
        fprintf(stderr, "%s: Error in pthread join - %s\nПрости, Джоин в сделку не входил\n", __FILE__, stderror(errno));
        return ERR_IN_JOIN;
    }
}
```

# Синхронизация, data race и все-все-все
А что, если добавить одну глобальную переменную? (~~ну это ignored~~)
```c
#include <pthread.h>
#include <stdio.h>
#include <string.h>
#include <errno.h>
#include <sys/types.h>
#include <sys/syscall.h>
#include <unistd.h>

int counter = 0

enum
{
    ERR_IN_THREAD_CREATE = 1,
    ERR_IN_JOIN = 2
};

void *incrC(void* msg)
{
    printf("in thread: %s counter = %d\n", (char *) msg, counter);
    ++counter;
}

int 
main()
{
    pthread_t thread1, thread2;
    if (pthread_create(&thread1, NULL, incrC, "thr1") != 0 || pthread_create(&thread2, NULL, incrC, "thr2") != 0) 
    {
        fprintf(stderr, "%s: Error in pthread creation - %s\n", __FILE__, stderror(errno));
        return ERR_IN_THREAD_CREATE;
    }

    if (pthread_join(thread1, NULL) != 0 || pthread_join(thread2, NULL) != 0) {
        fprintf(stderr, "%s: Error in pthread join - %s\nПрости, Джоин в сделку не входил\n", __FILE__, stderror(errno));
        return ERR_IN_JOIN;
    }

    printf("Res counter : %d\n", counter);
}
```

```
in thread: thr1 counter = 0
in thread: thr2 counter = 0
Res counter : 2
```
Здесь повезло с результатом выполнения, потому что операция ++ атомарна! Однако, в самом начале выполнения нитей значение переменной было равно нулю! Порядок выполнения программы в нитях здесь не определен, и это очень опасно!

Есть вариант исправления этой проблемы через задержки:
```c
void *incrC(void* msg)
{
    if (strncmp("thr1", (char*)msg, sizeof("thr1")))
        sleep(1);
    printf("in thread: %s counter = %d\n", (char *) msg, counter);
    ++counter;
}
```

Более оптимальный вариант - через pthread_mutex_t

```c
pthread_mutex_t mutex;

void *incrC(void* msg)
{
    pthread_mutex_lock(&mutex);
    printf("in thread: %s counter = %d\n", (char *) msg, counter);
    ++counter;
    pthread_mutex_unlock(&mutex);
}
```

```
in thread: thr1 counter = 0
in thread: thr2 counter = 1
Res counter : 2
```

```c
pthread_mutex_t mutex;

void *incrC(void* counter)
{
    pthread_mutex_lock(&mutex);
    int* cc = (int*)counter;
    printf("in thread: %d counter = %d\n", syscall(SYS_getttid), counter);
    ++(*cc);
    pthread_mutex_unlock(&mutex);
}
```

```
in thread 880 counter = 0
in thread 881 counter = 1
Res counter : 2
```


## execve

```c 
#include <unistd.h>
#include <sys/types.h>
#include <sys/wait.h>
#include <stdio.h>

int main(int argc, char *argv[])
{
    printf("Standing here\n")
    if (!fork())
    {
        execlp(argv[1], argv[1], NULL);
        _exit(1);
    }
    printf("I realize...\n")
    wait(NULL);
}

```

Задача на дом: Написать программу, которая запускает питоновский (ящерский) скрипт.